In [19]:
import sqlite3

In [20]:
Connection = sqlite3.connect('studentdsbsnew.db')

In [21]:
cursor = Connection.cursor()

In [22]:
print("connected")

connected

In [23]:
sql_command = ("""CREATE TABLE studentdsbsnew(regno INTEGER PRIMARY KEY,name VARCHAR(20),phonenumber INTEGER);""")
cursor.execute(sql_command)

In [24]:
print("table created")

table created

In [28]:
cursor.execute('''insert into studentdsbsnew values(1011,'subha',9900007878)''')
cursor.execute('''insert into studentdsbsnew values(1012,'prathibha',9900051324)''')
cursor.execute('''insert into studentdsbsnew values(1013,'mahi',8840507878)''')

In [30]:
print("the inserted data are as follows")
data=cursor.execute('''select * from studentdsbsnew''')
for row in data:
  print(row)

the inserted data are as follows
(101, 'subha', 9900007878)
(1011, 'subha', 9900007878)
(1012, 'prathibha', 9900051324)
(1013, 'mahi', 8840507878)

In [31]:
Connection.commit()

In [33]:
data=cursor.execute('''select * from studentdsbsnew where regno=1011''')
for row in data:
  print(row)

(1011, 'subha', 9900007878)

In [35]:
data=cursor.execute('''update studentdsbsnew SET phonenumber=9999999999 where regno=1012;''')
data=cursor.execute('''select * from studentdsbsnew where regno=1012''')
for row in data:
  print(row)

(1012, 'prathibha', 9999999999)

In [37]:
data=cursor.execute('''delete from studentdsbsnew where name="prathibha";''')
print("record deletd")
data=cursor.execute('''select * from studentdsbsnew''')
for row in data:
  print(row)

record deletd
(101, 'subha', 9900007878)
(1011, 'subha', 9900007878)
(1013, 'mahi', 8840507878)